{
  "id": "01JYCFSQKE7CMXMKNVBE49KYMR",
  "slug": "franchises/grand-tale/game/tales/tale-r",
  "type": "Default",
  "title": "Tale R",
  "categories": [
    "Tale"
  ],
  "tags": [],
  "properties": {},
  "blocks": [
    {
      "id": "01JYCFT8RVNKJHP27Z6F63ZCM6",
      "type": "paragraph",
      "attrs": {
        "text": [
          {
            "type": "text",
            "text": "Cooperative Campaign? 3 v 3 Competitive? 3 Player Cooperative? Elements of\n4X for meta progression? Grand Strategy map pvp battles are training\nroutines, powered by the cradle? building a massive base with multiple\nexpansions, microing fast upgraded armies, setting up an empire morality,\nmoral struggles of the cast, diplomacy, culture, setting differences aside\nlarge scale conflict figure out what the fun parts really are and focus on\nexpanding and evolving them - cut out the rest incentives to move out on\nthe map, explore, set forward positions possible \"large minimap\" hotkey\nlike an arpg, maybe enlarge it in place while holding alt 2v2 being the\n\"standard\" game mode? integrate more cooperation different balancing for\neach mode, 1v1 and 2v2 etc? lower early game lethality, feeling of phases\nlike a moba game? defender's advantage Second, we’re going to look at\nlethality in order to enable endlessly scalable difficulties. SC2 Co-op\nwas built around deleting waves instantly either via your units’ high DPS\nor very powerful “nuke”-style calldowns. By designing our game with less\nlethal units, we open ourselves up to greater opportunities for micro\nwithin a given fight and greater opportunities to debuff, which is\ngenerally very effective on stronger enemies. Less focus on calldowns that\nstrictly do damage. They Are Billions takes this concept to another level\nwhere every building has unique abilities/adjacency bonuses, and\nbase-building is almost half the game. That being said, we recognize that\nThey Are Billions is a single-player RTS and thus the player can be\nexpected to pay a greater % of his attention to this particular aspect of\nthe game. combined supply and production? design space for additional\nfactions? make the narrative and design in a way to not limit that option,\neven if we choose not to do it. high expansion incentives, and multiple\npoints of interest on maps to split forces War Council main base grants\ndouble as many resources as expansions, lower percentile increase in\nincome when you expand Resources third resource, like immortal's pyre?\nused for hero abilities etc, similar to sc2 campaign's spear of adun\nenergy Alloy/Aether/ Minerals Minerals are gathered from Mineral Clusters\nand are the primary resource for building structures, training units and\nresearching upgrades. Anima Anima is gathered from Anima Strands and are\nthe secondary resource for building structures, training units and\nresearching upgrades. Population Cap Population is a and has a maximum cap\nof 200. can be increased by certain structures and dictates the maximum\namount of units that can be owned. maximum 200 town hall provides 20 cap,\nworkers have 1 size, Sending resources, sharing resources Resources are\nnon depletable Unit Stats Unit Types Hero Unit Structure Movement Types\nGround (can only be attacked by Ground attacks) Air (can only be attacked\nby Air attacks) Damage Types Physical Damage Tooltip: Physical Damage is\naffected by Physical Resistance Magical Damage Tooltip: Magical Damage is\naffected by Magical Resistance Pure Damage Tooltip: Pure Damage is not\naffected by any type of Resistance. Resistance Types Physical Resistance\nTooltip: Every point of Physical Resistance reduces Physical Damage taken\nby 10%. Magical Resistance Tooltip: Every point of Magical Resistance\nreduces Magical Damage taken by 10%. Units have Physical Damage, Magical\nDamage, Physical Resistance, Magical Resistance. One of either Physical\nDamage or Magical Damage is the unit’s PRIMARY attack type, which dictates\nthe damage type of their basic attacks. Armour Types Light Moderate?\nArmored Fortified Heroic Abilities: Weapon Type: Damage Type: Attack\nSpeed/BAT/Cooldown: Attack Damage: Attack Range: Attack Targets: Armour\nType: Physical Resistance: Magical Resistance: Maximum Health: Health\nRegeneration: Maximum Mana: Mana Regeneration: Movement Type: Movement\nSpeed: Unit Type: Creation Time: Resource Costs: Population Size:\nPopulation Generated: Techtree Requirements: Researches Available: Units\nTrained: Upgrades To: Upgrades Used: Acquisition Range Backswing Attack\nPoint Turn Rate Collision Size Sight Range Moba only: Crit chance Crit\ndamage Block Cdr Status resist Status dur Cost redu Cast range All units\nhave same consistent base Turn Rate. All units have same consistent base\nAttack Time. All units have same consistent base Vision Radius. Tooltip:\nBuild Town Hall (Hotkey) Cost: 300 Minerals 100 Anima Population\nRequired/Generated: Production Time: 100 Seconds Attack Targets: Air,=\nGround Techtree Requirements: Lumber Mill, Barracks Enables: Gryphon\nRiders at the Enclave Laboratory Abilities: Train Knight Description,\nprimary structure for creating peasants. Units in the campaign,\ncooperative assaults, and multiplayer matches are all separate entities,\nallowing for easily recognisable balancing changes between them. Ascension\nBarracks Cost: X Y, X Y Build Time: Buildings Required: Units Trained:\nUpgrades Researched: Affected By Upgrades: Abilities: Stats: Attack\nDamage: Attack Targets: Attack Speed: Maximum Health: Armor: Enclave\nLaboratory Ascension Knight Enclave Sorcerer Ascension Vanguard Enclave\nGryphon Rider Population Building Dwarven Foundry Footman Archer Minotaur\nEnforcer War Machine Nekroz Crypt Nekroz Defiler Archer Knight Vampyrium\nSubjugator Nightsister Hideout Nightsister Acropolis scout unit Structures\n& Building Structures are not built from workers, but instead from a\nglobal building system accessible through the UI. This allows buildings to\nbe placed and built from anywhere inside friendly territory. Cancelling\nthe production of a building returns 75% of the invested resources. All\nstructures have an innate ability, Repair. Repair cannot be used if damage\nhas been taken by the structure in the past 5 seconds and will be\ninterrupted should any damage be taken. Repairing a structure restores any\nlost health on it at the cost of resources. The cost and time taken to\nrepair is proportional to the structure’s cost and production time, and\nproportional to the amount of health missing, being 25% of the structure’s\ncost in resources and 100% of the structure’s production time to reach a\nfull repair from 1 health. This ability is self-cast by the structure and\ndoes not require workers or any additional input. Upgrades Vision & Fog Of\nWar The map in standard matches, campaign missions and cooperative\nassaults is partially revealed, being completely visible but obfuscated by\nfog of war. Fog of war follows the traditional RTS functionality, being\nrevealed by units and their sight ranges, and displaying the last known\nstate of an area when obfuscated. Unit sight ranges can be blocked by\nterrain, but units with Air Movement completely bypass this and have\nunobstructed vision within their range. Terrain Being in a vertically\nhigher ground than another unit grants a vision advantage. Units in lower\nground have their vision obstructed to areas in higher ground, but units\nin higher ground can completely see the area below. If a unit in higher\nground attacks or otherwise interacts with a unit in lower ground that\ndoes not already have vision of it, it is individually revealed. Trees are\ninteractable and can be destroyed by certain units and abilities, allowing\nfor strategic formation of new pathways. Certain debris are also\ninteractable and can be destroyed by the player to open or close paths on\nthe terrain just the same. The terrain is implicitly divided as a grid,\nwhich becomes visible to players when they attempt to place a structure.\nThis only affects the placement of structures and other terrain features\nand is otherwise irrelevant for gameplay as units are not locked to this\ngrid. Scenario Initialization At the start of a standard multiplayer match\na faction hall is granted to each player at their starting location.\nAlongside it, a scout unit is spawned, and a mine is created with 4\nworkers inside which are automatically ordered to gather at the mineral\ncluster. Starting locations always contain a mineral cluster and an anima\nstrand within consistent distances from the faction hall. Standard matches\nbegin with players at 0 Minerals, 0 Anima, and a Population Cap of 10,\nprovided by their faction hall. As the player is granted a scout and four\nworkers, they effectively begin at 5/10 Population. Control Groups & Unit\nSelection Rally to control group Control group setting - allow unit to be\npart of multiple groups or not Formation movement Selecting multiple units\ngives access to their abilities, provided they have different hotkeys?\nGameplay Modes Up to 8-player matches Capital loss win condition? Peace\ntimer in custom games Diplomacy game mode in which players can make\nalliances Matchmaking glicko 2? Separate ratings for each race, solo and\nteam split ratings, random invisibly selects a race out of your ratings\nand matches you if you were playing that; unranked mmr?; matching arranged\nteams with soloq?think no Queue times; regions segments rating? Search\nbanding; percentile leagues; alongside mmr number; 5 placement games only;\n4 seasons per year; multiple game mode queues; rating decay? Map vetos?\nOmit revealing ratings & etc on loading screens/during match unless\nplayers opt in; hide in post game as well? Locked ranked play until\nrequirement is met like X games in other modes? Artificial Intelligence AI\nis utilized for non-player-controlled entities in the campaign and\ncooperative assaults, and as bots for multiplayer modes. All modes\ninvolving AI are divided into four difficulty settings: Novice, Adept,\nVeteran, and Master. These difficulty settings dictate how skilful the AI\nwill be, and in some instances how much of the game it will have access\nto. Multiplayer bots can have multiple build orders and strategies\nprogrammed, which may be selected in the case of custom matches. Novice AI\nDoes not research Faction Weapon and Faction Armour upgrades. Is\nhandicapped in its ability to perform actions such as using unit\nabilities. Has delayed attack timings and is very passive. Adept AI\nResearches only the first level of Faction Weapon and Faction Armour\nupgrades. Is handicapped in its ability to perform actions, but less so\nthan the Novice AI. Has delayed attack timings and is moderately passive.\nVeteran AI Researches up to the second level of Faction Weapon and Faction\nArmour upgrades. Is handicapped in its ability to perform actions, but\nless so than the Adept AI. Does not have delayed attack timings and is\nmoderately aggressive. Master AI Researches up to the third level of\nFaction Weapon and Faction Armour upgrades. Has no other sort of\nhandicaps, executing actions to the best of its capabilities. Does not\nhave delayed attack timings and is very aggressive. When playing alongside\nAI teammates in multiplayer matches an additional interface menu will be\nactivated, allowing command over the AI such as choosing strategies for\nopening builds and late game progression, requesting resources, commanding\nattacks and defences, requesting scouting, requesting detection, and\nsuggesting expansion locations. mana shields on one of the factions like\nprotoss dragonhawk rider that can land like vikings global building with B\nkey, no workers needed. can only build in territory? building doesnt\ndeselect units begin match with workers on node and 0 resources building\nover trees, destroying them? Town Hall trains workers can upgrade 2 times,\nincreases pop cannot be built, only one victory condition? buildings split\ninto catergories, standard/economy, military, etc territories have\nbuilding cap? toggle to show terrain contents like northgard claiming\nterritory House provides pop can be upgraded? farm, mine, woodcutter, etc\n- goes on hotspots next to resources spawn with scout, cant be built, has\nno attack? crest cosmetic like sc2? player colours resources don't deplete\nbuildings show allocated workers upgrading workers at the gathering\nbuilding lore resource? market port/harbor Custom Game Setting - Truce\nTime Custom Game Setting - Economy Multiplier Game Modes - Team, Free For\nAll, Diplomacy? Patrol, follow Free camera mode, camera normally does not\nrotate. Display resource earn rates on UI, display supply and how its\ndivided in workers and army units, and number of workers in each\nresource/slot possible Day & Night Cycles Show current upgrades, builds\nand trainings in progress in UI like sc2 spectator Ping wheel Replay\nsystem, collaborative watching, similar to spectate Scout outposts things,\nlike xel naga towers and other neutral structures, can be captured for\nadvantages, can switch sides. Gateways neutral buildings? Or built like\nnydus worms? Neutral creeps around the map blocking pathways, resource\npoints, neutral structures, etc. Neutral mercenary hire buildings? Market\nto trade resources at a cost Ground and Air upgrades up to lvl 3 Expanding\nborders, can only build inside borders Unit ability - infest mind, shares\nsight with caster for a duration Drop off building, has gather upgrades\nfor workers Building upgrades Warthog Rider Passive techtree bonuses like\nRoL Research? Unit that buffs buildings Like a chrono boost Creating\nwaypoints like nydus networks sc2 desert strike / Immortal Wave Wars game\nmode \"commanders\" like immortal's immortals, switches some (2?) units like\nimmortal's vanguards and grants special abilities similar to sc2 coop\ncommanders space for more adding more factions? 6 characters in each\ncampaign Triune - King, advisor, Enclave leader, sect leader, order\nleader, ? Paragon - leaders of each of the 6 paragon clans Legion - 3 of\neach house Dominion - Linear unlock system? Game difficulty; Lvl 15\ncommanders; accessibility campaign and coop have separately named units to\nalleviate confusion with balance patches in multiplayer (example Raynor\nMarine); mastery levels (100)? Generic across everyone perhaps? Jus stat\nboosts or something Missions have primary and secondary objectives; attack\nwaves; timers; implicit splitting of content for coop; mutations; endgame?\nRandomized enemy unit compositions; not quite a tutorial but well\npositioned mission information and game mode mechanics Paragon - Scans,\nstealth, ranged Dominion - Energy fields, teleportation matrix Legion -\nburrowing, corpses, production from main building like larva,\ntomb/ctacomb/crypt/tunnel system like nydus blink that costs shields/mana\nimmortal hallower-style artillery, long range energy beam from the sky\nwarg rider Symbiote Thorn Acropolis Dervish _ Hall war zeppelin\n(transport) Sizes Small (1 Transport Slot) Medium (2 Transport Slots)\nLarge (8 Transport Slots) Armor Type Light Medium Heavy worker movespeed:\n2.8125 squire movespeed: 2.25 defiler/Ravager/ movespeed: 2.9531 Hero\nmovespeed: 2.5 Unit Ideas Angel Harpy Sphinx Faerie Flying Manta Ray Ship\nOwl Rider Gnoll Wolf Rider Undead Dragon/Wyrm/Wyvern/Bone Dragon/Zombie\nDragon Spear-throwing Air Unit On Flying Beast phoenix rider war mammoth\ncentaur caster/ranger Recall neural parasite oracle revelation ability\nforce fields units that merge like archon viper abduct psi storm\ndragonhawk-like unit that lands cloaking air unit? healing air unit like\nmedivac unit with blink widow mine fast flying unit like muta mid range\nunit like roach swarm host? unit that is supply structure units that\nburrow bouncing attacks unit? colossus-like unit suicide unit like\nbaneling carrier or brood lord-like unit Unit Names Goblin Harvester\nScavenger Envoy Onager Phoenix Lancer Turtle Hydra Salamander Lich Treant\nContraption Devourer Destroyer Corruptor Supplicant Cultist Acolyte\nAutomaton Conscript Trooper Strider Sentinel Spectre Marauder Reaper Ghost\nLiberator Banshee Stalker Zealot Disruptor Archon Templar Sentry Observer\nInfestor Druid Dryad Ravager Satyr Corruptor Devourer Barge Guardian\nCrotalus Zeppelin Cabalist Drake Phantom Banshee Zombie Slayer Outrider\nEmpus Oracle Revenant Demolisher Stalker Marauder Overseer Sentinel\nHighborne Swordsman Horror Destroyer Infiltrator Tormentor Heaver\nArtillery Exarch Shaman Rampager Arcanist Construct Disruptor Roc\nManticore Rampart Decimator Spellbinder Illuminator Basilisk Dragonfly\nThaumaturge Augur Hierarch Ascendant Squire Knight Cleric Watcher\nStructure Ideas Tree Building bunker, loads units Structure Names Lodge\nCoral Bed Quarry Extractor Palace Well Dwelling Aviary Haven Hovel Post\nSacrarium Redoubt Keep Henge Chamber Den Arbor Hall Bastion Sawmill Dais\nAltar of Memories Idol Horn Repository Chancel Academy Laboratory Lyceum\nPylon Bunker Refinery Workshop Armory Vault Hive Graveyard Tomb Mausoleum\nCatacomb Sepulcher Lair Palisade Bastion Garrison Drake _ Machine Fairy\nWyvern Coatl Rider Dru",
            "marks": []
          }
        ]
      },
      "slots": {}
    },
    {
      "id": "01JYCHA3PYWC1AHQ7PJFFE8C73",
      "type": "section",
      "attrs": {
        "title": "Trivia"
      },
      "isTemplated": true,
      "slots": {
        "default": []
      }
    }
  ],
  "lastModified": "2025-06-22T20:19:00.107Z"
}