Repository: idantitydotme/idantity.me
Catalog: locales/*/messages.po
Languages: pt

source: sectionBlock.headingPlaceholder
pt: Título da seção

source: scriptBlock.titlePlaceholder
pt: Título do roteiro

source: scriptBlock.synopsisPlaceholder
pt: Sinopse do roteiro

source: scriptBlock.addCharacterPlaceholder
pt: Adicionar personagem

source: scriptBlock.addCharacterButton
pt: Adicionar Personagem

source: scriptBlock.removeCharacterAriaLabel
pt: Remover personagem

source: scriptBlock.aPlotPlaceholder
pt: A trama principal

source: scriptBlock.bPlotPlaceholder
pt: A trama secundária

source: scriptBlock.cPlotPlaceholder
pt: A terceira trama

source: scriptBlock.stingerPlaceholder
pt: O stinger

source: sceneBlock.timeOfDay.MORNING
pt: MANHÃ

source: sceneBlock.timeOfDay.NOON
pt: DIA

source: sceneBlock.timeOfDay.AFTERNOON
pt: TARDE

source: sceneBlock.timeOfDay.EVENING
pt: NOITE

source: sceneBlock.timeOfDay.NIGHT
pt: MADRUGADA

source: sceneBlock.timeOfDay.OTHER
pt: OUTRO

source: sceneBlock.setting.INTERIOR
pt: INTERIOR

source: sceneBlock.setting.EXTERIOR
pt: EXTERIOR

source: sceneBlock.setting.OTHER
pt: OUTRO

source: sceneBlock.transition.CUT_TO_SCENE
pt: CORTE PARA

source: sceneBlock.transition.CUT_BACK_TO_SCENE
pt: CORTE DE VOLTA PARA

source: sceneBlock.transition.FADE_TO_SCENE
pt: FADE PARA

source: sceneBlock.locationPlaceholder
pt: Localização da cena

source: sceneBlock.descriptionPlaceholder
pt: Descrição da cena

source: dialogueBlock.characterNamePlaceholder
pt: Nome do personagem

source: dialogueBlock.parentheticalPlaceholder
pt: Parêntese (ex: sussurrando)

source: dialogueBlock.linePlaceholder
pt: Linha de diálogo

source: Enter URL:
pt: Inserir URL:

source: block.displayNameFallback
pt: Bloco

source: block.parentDisplayNameFallback
pt: Bloco Pai

source: blockSlot.ariaLabelEmptySlot
pt: Espaço vazio para bloco

source: block.ariaLabelBlockType
pt: Tipo de bloco

source: 404 - Page Not Found
pt: 404 - Página Não Encontrada

# scriptBlock.aPlotLabel
source: A Plot
pt: A Trama

# scriptBlock.act1Title
source: Act 1
pt: ATO 1

# scriptBlock.act2Title
source: Act 2
pt: ATO 2

# scriptBlock.act3Title
source: Act 3
pt: ATO 3

# scriptBlock.bPlotLabel
source: B Plot
pt: A Trama B

# scriptBlock.cPlotLabel
source: C Plot
pt: A Trama C

# blockSlot.cannotNestBlock
source: Cannot nest {draggedBlockDisplayName} in {parentBlockDisplayName}
pt: Não é possível aninhar este bloco aqui.

# scriptBlock.charactersSectionTitle
source: Characters
pt: Personagens

source: Delete
pt: Excluir

# sceneBlock.descriptionLabel
source: Description
pt: Descrição

# blockSlot.emptySlotPlaceholder
source: Drag and drop blocks here or click to add
pt: Arraste e solte blocos aqui ou pressione para adicionar.

source: Duplicate
pt: Duplicar

source: Go to Homepage
pt: Ir para a Página Inicial

source: Insert Block Above
pt: Inserir Bloco Acima

source: Insert Block Below
pt: Inserir Bloco Abaixo

# sceneBlock.locationLabel
source: Location
pt: Localização

# blockSlot.nestBlock
source: Nest {draggedBlockDisplayName} in {parentBlockDisplayName}
pt: Aninhar bloco

# scriptBlock.noCharactersAdded
source: No characters added yet.
pt: Nenhum personagem adicionado ainda.

# scriptBlock.overviewSectionTitle
source: Overview
pt: Visão Geral

# scriptBlock.plotsSectionTitle
source: Plots
pt: Tramas

# sceneBlock.title
source: Scene Block
pt: Cena

# scriptBlock.title
source: Script Block
pt: Roteiro

# scriptBlock.structureSectionTitle
source: Structure
pt: Estrutura

# scriptBlock.synopsisLabel
source: Synopsis
pt: Sinopse

# scriptBlock.titleLabel
source: Title
pt: Título

source: We're sorry, the page you requested could not be found.
pt: Lamentamos, a página que você solicitou não pôde ser encontrada.
